# 18.3 Relational Databases and Structured Query Language (SQL)
### Tables, Rows and Columns
### Selecting Data Subsets
### SQLite
## 18.3.1 A `books` Database
### Creating the `books` Database
### Connecting to the Database in Python

In [1]:
import sqlite3

In [2]:
connection = sqlite3.connect('books.db')

### `authors` Table
### Viewing the `authors` Tableâ€™s Contents

In [3]:
import pandas as pd

In [32]:
pd.options.display.max_columns = 10

In [33]:
pd.read_sql('SELECT * FROM authors', connection,
            index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald

In [ ]:
Elsa Ghirmazion

### `titles` Table

In [6]:
pd.read_sql('SELECT * FROM titles', connection)

         isbn                             title  edition copyright
0  0135404673     Intro to Python for CS and DS        1      2020
1  0132151006     Internet & WWW How to Program        5      2012
2  0134743350               Java How to Program       11      2018
3  0133976890                  C How to Program        8      2016
4  0133406954  Visual Basic 2012 How to Program        6      2014
5  0134601548          Visual C# How to Program        6      2017
6  0136151574         Visual C++ How to Program        2      2008
7  0134448235                C++ How to Program       10      2017
8  0134444302            Android How to Program        3      2017
9  0134289366         Android 6 for Programmers        3      2016

### `author_ISBN` Table

In [7]:
df = pd.read_sql('SELECT * FROM author_ISBN', connection)

In [8]:
df.head()

   id        isbn
0   1  0134289366
1   2  0134289366
2   5  0134289366
3   1  0135404673
4   2  0135404673

Elsa Ghirmazion

### Entity-Relationship (ER) Diagram
### SQL Keywords
## 18.3.2 `SELECT` Queries

In [9]:
pd.read_sql('SELECT first, last FROM authors', connection)

       first    last
0       Paul  Deitel
1     Harvey  Deitel
2      Abbey  Deitel
3        Dan   Quirk
4  Alexander    Wald

## 18.3.3 `WHERE` Clause

In [10]:
pd.read_sql("""SELECT title, edition, copyright 
                FROM titles 
                WHERE copyright > '2016'""", connection)

                           title  edition copyright
0  Intro to Python for CS and DS        1      2020
1            Java How to Program       11      2018
2       Visual C# How to Program        6      2017
3             C++ How to Program       10      2017
4         Android How to Program        3      2017

In [ ]:
Elsa Ghirmazion

### Pattern Matching: Zero or More Characters

In [11]:
pd.read_sql("""SELECT id, first, last 
                FROM authors 
                WHERE last LIKE 'D%'""", 
             connection, index_col=['id'])

     first    last
id
1     Paul  Deitel
2   Harvey  Deitel
3    Abbey  Deitel

              

### Pattern Matching: Any Character

In [12]:
pd.read_sql("""SELECT id, first, last 
                FROM authors 
                WHERE first LIKE '_b%'""", 
             connection, index_col=['id'])

    first    last
id
3   Abbey  Deitel

In [ ]:
Elsa Ghirmazion

              

## 18.3.4 `ORDER BY` Clause

In [13]:
pd.read_sql('SELECT title FROM titles ORDER BY title ASC',
             connection)

                              title
0         Android 6 for Programmers
1            Android How to Program
2                  C How to Program
3                C++ How to Program
4     Internet & WWW How to Program
5     Intro to Python for CS and DS
6               Java How to Program
7  Visual Basic 2012 How to Program
8          Visual C# How to Program
9         Visual C++ How to Program

### Sorting By Multiple Columns

In [14]:
pd.read_sql("""SELECT id, first, last 
                FROM authors 
                ORDER BY last, first""", 
             connection, index_col=['id'])

        first    last
id
3       Abbey  Deitel
2      Harvey  Deitel
1        Paul  Deitel
4         Dan   Quirk
5   Alexander    Wald

In [ ]:
Elsa Ghirmazion

In [15]:
pd.read_sql("""SELECT id, first, last 
                FROM authors 
                ORDER BY last DESC, first ASC""", 
             connection, index_col=['id'])

        first    last
id
5   Alexander    Wald
4         Dan   Quirk
3       Abbey  Deitel
2      Harvey  Deitel
1        Paul  Deitel

              

### Combining the `WHERE` and `ORDER BY` Clauses

In [16]:
pd.read_sql("""SELECT isbn, title, edition, copyright
                FROM titles
                WHERE title LIKE '%How to Program'
                ORDER BY title""", connection)

         isbn                             title  edition copyright
0  0134444302            Android How to Program        3      2017
1  0133976890                  C How to Program        8      2016
2  0134448235                C++ How to Program       10      2017
3  0132151006     Internet & WWW How to Program        5      2012
4  0134743350               Java How to Program       11      2018
5  0133406954  Visual Basic 2012 How to Program        6      2014
6  0134601548          Visual C# How to Program        6      2017
7  0136151574         Visual C++ How to Program        2      2008

In [ ]:
Elsa Ghirmazion

## 18.3.5 Merging Data from Multiple Tables: `INNER JOIN`

In [18]:
pd.read_sql("""SELECT first, last, isbn
                FROM authors
                INNER JOIN author_ISBN
                    ON authors.id = author_ISBN.id
                ORDER BY last, first""", connection).head()

    first    last        isbn
0   Abbey  Deitel  0132151006
1   Abbey  Deitel  0133406954
2  Harvey  Deitel  0134289366
3  Harvey  Deitel  0135404673
4  Harvey  Deitel  0132151006

## 18.3.6 `INSERT INTO` Statement

In [19]:
cursor = connection.cursor()

In [20]:
cursor = cursor.execute("""INSERT INTO authors (first, last)
                            VALUES ('Sue', 'Red')""")

In [21]:
pd.read_sql('SELECT id, first, last FROM authors', 
             connection, index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald
6         Sue     Red

In [ ]:
Elsa Ghirmazion

### Note Regarding Strings That Contain Single Quotes
# 18.3.7 `UPDATE` Statement

In [22]:
cursor = cursor.execute("""UPDATE authors SET last='Black'
                            WHERE last='Red' AND first='Sue'""")

In [ ]:
cursor.rowcount

In [23]:
pd.read_sql('SELECT id, first, last FROM authors', 
             connection, index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald
6         Sue   Black

In [ ]:
Elsa Ghirmazion

# 18.3.8 `DELETE FROM` Statement

In [26]:
cursor = cursor.execute('DELETE FROM authors WHERE id=6')

In [27]:
cursor.rowcount

0

In [28]:
pd.read_sql('SELECT id, first, last FROM authors', 
             connection, index_col=['id'])

        first    last
id
1        Paul  Deitel
2      Harvey  Deitel
3       Abbey  Deitel
4         Dan   Quirk
5   Alexander    Wald

In [ ]:
Elsa Ghirmazion

### Closing the Database

```
connection.close()
```

### SQL in Big Data

![Self Check Exercises check mark image](files/art/check.png)
# Self Check for Section 17.3
1. **_(IPython Session)_** Select from the `titles` table all the titles and their edition numbers in descending order by edition number. Show only the first three results.

In [29]:
pd.read_sql("""SELECT title, edition FROM titles
               ORDER BY edition DESC""", connection).head(3)

                 title  edition
0  Java How to Program       11
1   C++ How to Program       10
2     C How to Program        8

2. **_(IPython Session)_** Select from the `authors` table all authors whose first names start with `'A'`.

In [30]:
pd.read_sql("""SELECT * FROM authors
               WHERE first LIKE 'A%'""", connection)

   id      first    last
0   3      Abbey  Deitel
1   5  Alexander    Wald

3. **_(IPython Session)_** SQLâ€™s `NOT` keyword reverses the value of a `WHERE` clauseâ€™s condition. Select from the `titles` table all titles that do not end with `'How to Program'`.

In [31]:
pd.read_sql("""SELECT isbn, title, edition, copyright
                FROM titles
                WHERE title NOT LIKE '%How to Program'
                ORDER BY title""", connection)

         isbn                          title  edition copyright
0  0134289366      Android 6 for Programmers        3      2016
1  0135404673  Intro to Python for CS and DS        1      2020

Elsa Ghirmazion

In [ ]:
##########################################################################
# (C) Copyright 2019 by Deitel & Associates, Inc. and                    #
# Pearson Education, Inc. All Rights Reserved.                           #
#                                                                        #
# DISCLAIMER: The authors and publisher of this book have used their     #
# best efforts in preparing the book. These efforts include the          #
# development, research, and testing of the theories and programs        #
# to determine their effectiveness. The authors and publisher make       #
# no warranty of any kind, expressed or implied, with regard to these    #
# programs or to the documentation contained in these books. The authors #
# and publisher shall not be liable in any event for incidental or       #
# consequential damages in connection with, or arising out of, the       #
# furnishing, performance, or use of these programs.                     #
##########################################################################